tehDA/v2eaudio/v2SpeechEnhancer/sdkconfig.defaults.esp32s2
CONFIG_IDF_CMAKE=y
CONFIG_IDF_TARGET_ARCH_XTENSA=y
CONFIG_IDF_TARGET="esp32s2"
CONFIG_IDF_TARGET_ESP32S2=y
CONFIG_IDF_FIRMWARE_CHIP_ID=0x0002

#
# Audio HAL
#
CONFIG_ESP32_S2_KALUGA_1_V1_2_BOARD=y

# ========= I2C driver (esp_driver_i2c) =========
CONFIG_I2C_SKIP_LEGACY_CONFLICT_CHECK=y
